Diana257/Sistem-de-monitorizare-a-parametrilor-de-mediu-ai-unei-plante-bazat-pe-STM32-si-Bluetooth-/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOF
#define SOIL_SENSOR_ADC_Pin GPIO_PIN_0
#define SOIL_SENSOR_ADC_GPIO_Port GPIOA
#define WATER_SENSOR_Pin GPIO_PIN_1
#define WATER_SENSOR_GPIO_Port GPIOA
#define USART2_TX_Pin GPIO_PIN_2
#define USART2_TX_GPIO_Port GPIOA
#define USART2_RX_Pin GPIO_PIN_3
#define USART2_RX_GPIO_Port GPIOA
#define LED_GREEN_Pin GPIO_PIN_5
#define LED_GREEN_GPIO_Port GPIOA
#define DHT11_Pin_Pin GPIO_PIN_7
#define DHT11_Pin_GPIO_Port GPIOA
#define LEDGREEN_Pin GPIO_PIN_8
#define LEDGREEN_GPIO_Port GPIOA
#define SOIL_SENSOR_D0_Pin GPIO_PIN_7
#define SOIL_SENSOR_D0_GPIO_Port GPIOC
#define LEDYELLOW_Pin GPIO_PIN_10
#define LEDYELLOW_GPIO_Port GPIOA
#define MOTOR_BI_Pin GPIO_PIN_12
#define MOTOR_BI_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define MOTOR_FI_Pin GPIO_PIN_4
#define MOTOR_FI_GPIO_Port GPIOB
#define LDRED_Pin GPIO_PIN_5
#define LDRED_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
